In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('../data/auto.csv', index_col='ID', sep=',')
df.head()

       CarNumber  Make_n_model  Refund   Fines  History
ID
0   Y163O8161RUS    Ford Focus     2.0  3200.0      NaN
1    E432XX77RUS  Toyota Camry     1.0  6500.0      NaN
2    7184TT36RUS    Ford Focus     1.0  2100.0      NaN
3   X582HE161RUS    Ford Focus     2.0  2000.0      NaN
4   E34877152RUS    Ford Focus     2.0  6100.0      NaN

In [4]:
df.count()

CarNumber       931
Make_n_model    931
Refund          914
Fines           869
History          82
dtype: int64

In [5]:
df.drop_duplicates(subset=['CarNumber','Make_n_model', 'Fines'], keep='last', inplace=True)
df.count()

CarNumber       725
Make_n_model    725
Refund          713
Fines           665
History          65
dtype: int64

In [6]:
df.isnull().sum()

CarNumber         0
Make_n_model      0
Refund           12
Fines            60
History         660
dtype: int64

In [7]:
df.dropna(axis='columns', thresh=500, inplace=True)
df.isnull().sum()

CarNumber        0
Make_n_model     0
Refund          12
Fines           60
dtype: int64

In [8]:
df['Refund'].ffill( inplace=True)
df.isnull().sum()

/tmp/ipykernel_78093/290932378.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Refund'].ffill( inplace=True)

CarNumber        0
Make_n_model     0
Refund           0
Fines           60
dtype: int64

In [17]:
m_fines=df['Fines'].mean(skipna=True)
df['Fines'].fillna(value=m_fines, inplace=True)
df.isnull().sum()

/tmp/ipykernel_65442/713795511.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Fines'].fillna(value=m_fines, inplace=True)

CarNumber       0
Make_n_model    0
Refund          0
Fines           0
dtype: int64

In [9]:
df[['Make', 'Model']]=df['Make_n_model'].str.split(expand=True)
df.drop(columns='Make_n_model', inplace=True)
df

        CarNumber  Refund    Fines    Make    Model
ID
0    Y163O8161RUS     2.0   3200.0    Ford    Focus
1     E432XX77RUS     1.0   6500.0  Toyota    Camry
2     7184TT36RUS     1.0   2100.0    Ford    Focus
3    X582HE161RUS     2.0   2000.0    Ford    Focus
5    92918M178RUS     1.0   5700.0    Ford    Focus
..            ...     ...      ...     ...      ...
926  Y163O8161RUS     2.0   1600.0    Ford    Focus
927  M0309X197RUS     1.0  22300.0    Ford    Focus
928  O673E8197RUS     2.0    600.0    Ford    Focus
929  8610T8154RUS     1.0   2000.0    Ford    Focus
930  H419XE197RUS     2.0      NaN  Toyota  Corolla

[725 rows x 5 columns]

In [10]:
df.to_json('../data/auto.json',orient="records", double_precision=1)